In [26]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [11]:
df = pd.read_csv('ratings_db.csv')

In [12]:
df.head()

   id  user_id  movie_id  rating             rated_at
0   1      196       242       3  1997-12-04 07:55:49
1   2      186       302       3  1998-04-04 11:22:22
2   3       22       377       1  1997-11-06 23:18:36
3   4      244        51       2  1997-11-26 21:02:03
4   5      166       346       1  1998-02-01 21:33:16

In [13]:
movie_titles = pd.read_csv('movies_db.csv')

In [14]:
movie_titles.head()

   id              title release_date
0   1   Toy Story (1995)   1995-01-01
1   2   GoldenEye (1995)   1995-01-01
2   3  Four Rooms (1995)   1995-01-01
3   4  Get Shorty (1995)   1995-01-01
4   5     Copycat (1995)   1995-01-01

In [24]:
movie_titles = movie_titles.rename(columns = {"id": "movie_id"})
movie_titles.head()

   movie_id              title release_date
0         1   Toy Story (1995)   1995-01-01
1         2   GoldenEye (1995)   1995-01-01
2         3  Four Rooms (1995)   1995-01-01
3         4  Get Shorty (1995)   1995-01-01
4         5     Copycat (1995)   1995-01-01

In [25]:
df = pd.merge(df, movie_titles, on = 'movie_id')
df.head()

,id,user_id,movie_id,rating,rated_at,title,release_date
0,1,196,242,3,1997-12-04 07:55:49,Kolya (1996),1997-01-24
1,254,63,242,3,1997-10-01 16:06:30,Kolya (1996),1997-01-24
2,630,226,242,5,1998-01-03 20:37:51,Kolya (1996),1997-01-24
3,1233,154,242,3,1997-11-09 21:03:55,Kolya (1996),1997-01-24
4,2160,306,242,5,1997-10-10 10:16:33,Kolya (1996),1997-01-24

In [27]:
df.describe()

                  id       user_id       movie_id         rating
count  100000.000000  100000.00000  100000.000000  100000.000000
mean    50000.500000     462.48475     425.530130       3.529860
std     28867.657797     266.61442     330.798356       1.125674
min         1.000000       1.00000       1.000000       1.000000
25%     25000.750000     254.00000     175.000000       3.000000
50%     50000.500000     447.00000     322.000000       4.000000
75%     75000.250000     682.00000     631.000000       4.000000
max    100000.000000     943.00000    1682.000000       5.000000

In [30]:
ratings = pd.DataFrame(df.groupby("title")["rating"].mean())
ratings.head()

                             rating
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

In [31]:
ratings['number_of_ratings'] = df.groupby('title')['rating'].count()
ratings.head()

                             rating  number_of_ratings
title
'Til There Was You (1997)  2.333333                  9
1-900 (1994)               2.600000                  5
101 Dalmatians (1996)      2.908257                109
12 Angry Men (1957)        4.344000                125
187 (1997)                 3.024390                 41